#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция УведомленияДляОтправки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияДляТелеграма.ТекстСообщения,
	|	ВКМ_УведомленияДляТелеграма.Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияДляТелеграма КАК ВКМ_УведомленияДляТелеграма";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Структура = Новый Структура;
		Структура.Вставить("Ссылка", Выборка.Ссылка);
		Структура.Вставить("ТекстСообщения", Выборка.ТекстСообщения);
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

#КонецОбласти	
	
#КонецЕсли