#Если Сервер Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДнейОтпускаВБазе(Сотрудник, Год) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусков.ДатаНачала, ВКМ_ГрафикОтпусков.ДатаОкончания, ДЕНЬ)) КАК КоличествоДней
	               |ИЗ
	               |	РегистрСведений.ВКМ_ГрафикОтпусков КАК ВКМ_ГрафикОтпусков
	               |ГДЕ
	               |	ВКМ_ГрафикОтпусков.Сотрудник = &Сотрудник
	               |	И ВКМ_ГрафикОтпусков.Год = &Год";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Год", Год);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат 0;
	Иначе
		Выборка.Следующий();
		Возврат Выборка.КоличествоДней;
	КонецЕсли;	

КонецФункции

#КонецОбласти

#КонецЕсли