#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКоличествоДней();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьКоличествоДней();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник) И ЗначениеЗаполнено(Объект.Год) Тогда
		ДнейОтпускаЗапланировано = ДнейОтпускаВБазе(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник, Объект.Год);
		Элементы.ОтпускаСотрудников.ТекущиеДанные.КоличествоДней = ДнейОтпускаЗапланировано + (НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
			- НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала)) / (60 * 60 * 24);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала) 
		И ЗначениеЗаполнено(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник) И ЗначениеЗаполнено(Объект.Год) Тогда
		ДнейОтпускаЗапланировано = ДнейОтпускаВБазе(Элементы.ОтпускаСотрудников.ТекущиеДанные.Сотрудник, Объект.Год);
		Элементы.ОтпускаСотрудников.ТекущиеДанные.КоличествоДней = ДнейОтпускаЗапланировано + (НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаОкончания) 
			- НачалоДня(Элементы.ОтпускаСотрудников.ТекущиеДанные.ДатаНачала)) / (60 * 60 * 24);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрПередачи = ПолучитьТабличныеДанныеДокумента();
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПараметрПередачи", ПараметрПередачи);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ДополнительныеПараметры, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличныеДанныеДокумента()
	
	ТаблицаЗначений = Объект.ОтпускаСотрудников.Выгрузить();
	ТабличныеДанные = Новый ХранилищеЗначения(ТаблицаЗначений);
	СтрокаСериализации = ВКМ_ПолезныеФункции.СериализацияXML(ТабличныеДанные);
	ПараметрПередачи = ЗначениеВСтрокуВнутр(СтрокаСериализации);
	Возврат ПараметрПередачи;

КонецФункции

&НаСервере
Функция ДнейОтпускаВБазе(Сотрудник, Год)
	
	Возврат РегистрыСведений.ВКМ_ГрафикОтпусков.ДнейОтпускаВБазе(Сотрудник, Год);

КонецФункции

&НаСервере
Функция ЗаполнитьКоличествоДней()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Если ЗначениеЗаполнено(Строка.Сотрудник) И ЗначениеЗаполнено(Объект.Год) Тогда
			ДнейОтпускаЗапланировано = ДнейОтпускаВБазе(Строка.Сотрудник, Объект.Год);
		Иначе
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(Строка.ДатаНачала) И ЗначениеЗаполнено(Строка.ДатаОкончания) Тогда
			Строка.КоличествоДней = ДнейОтпускаЗапланировано + (НачалоДня(Строка.ДатаОкончания) 
				- НачалоДня(Строка.ДатаНачала)) / (60 * 60 * 24);
		Иначе
			Строка.КоличествоДней = ДнейОтпускаЗапланировано;	
		КонецЕсли;
	КонецЦикла;

КонецФункции

#КонецОбласти