#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрПередачи") Тогда
		ПостроитьДиаграмму(Параметры.ПараметрПередачи);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Не передан параметр построения диаграммы");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграмму(ПараметрПередачи)
	
	ТаблицаЗначенийСтрока = ЗначениеИзСтрокиВнутр(ПараметрПередачи);
	ХранилищеТаблицы = ВКМ_ПолезныеФункции.ДесериализацияXML(ТаблицаЗначенийСтрока);
	ТаблицаЗначений = ХранилищеТаблицы.Получить();
	ГрафикОтпусков.Очистить();
	
	ТаблицаЗначений.Сортировать("ДатаНачала");
	
	Серия = ГрафикОтпусков.Серии.Добавить();
	Серия.Текст = "Отпуск";
	Серия.Цвет = WebЦвета.СинеФиолетовый;
	
	Для Каждого Строка Из ТаблицаЗначений Цикл
		Точка = ГрафикОтпусков.УстановитьТочку(Строка.Сотрудник); // Родитель = "Демо"
		Точка.Текст = Строка(Строка.Сотрудник);
		Точка.Картинка = БиблиотекаКартинок.ПользовательБезФотографии;
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		Значение.Редактирование = Ложь;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
		
			
	КонецЦикла;

КонецПроцедуры

#КонецОбласти