#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
		Движение.Год = Год;
		Движение.Регистратор = Ссылка;
	КонецЦИкла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли