#Область СлужебныеПроцедурыИФункции

Функция СтрокаВыборкиВСтруктуру(Выборка, Пустой = Ложь) Экспорт

	Результат = Новый Структура;
	
	Для каждого Колонка Из Выборка.Владелец().Колонки Цикл
		Результат.Вставить(Колонка.Имя);
	КонецЦикла; 
	
	Если Не Пустой Тогда 
		ЗаполнитьЗначенияСвойств(Результат,Выборка);
	КонецЕсли;

	Возврат Результат;

КонецФункции

Функция СериализацияXML(ОбъектСериализации) Экспорт

	ЗаписьXML = Новый ЗаписьXML();
	ЗаписьXML.УстановитьСтроку();
	ЗаписатьXML(ЗаписьXML, ОбъектСериализации);
	ТекстXML = ЗаписьXML.Закрыть();
	
	Возврат ТекстXML;

КонецФункции

Функция ДесериализацияXML(ТекстXML) Экспорт

	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(ТекстXML);
	ОбъектДесериализации = ПрочитатьXML(ЧтениеXML);
	
	Возврат ОбъектДесериализации;

КонецФункции

#КонецОбласти